Autodesk.Revit.DB.ExternalResourceReference.HasValidDisplayPath
Checks whether this external Resource has a valid display path.
Remarks:
For an external resource, such as a Revit link loaded from an external server, the valid display path
should be like "My Server://Nested/Nested_1.rvt".
For an external resource, such as a Revit link loaded from the "built-in" server, the valid display path
should be like "c:\LocalLinks\Link_1.rvt".
Returns:
True if the this external Resource has a valid display path. False otherwise.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.GetResourceShortDisplayName
Gets the short display name of the external resource.
Remarks:
For an external resource, such as a Rvt Link loaded from an external server, which has a full display path
such as "My Server://Nested/Nested_1.rvt", this function returns "Nested_1.rvt".
For an external resource, such as a Rvt Link loaded from the "built-in" server, which has a full display path
such as "c:\LocalLinks\Link_1.rvt", this function returns "Link_1.rvt".
Returns:
The short display name of the external resource.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The ExternalResourceReference (this ExternalResourceReference) is has no valid display path.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.GetResourceVersionStatus
Checks whether this ExternalResourceReference corresponds to the current version of the resource.
Remarks:
This method should only be called if the ExternalResourceServer that provides the resource
is present.
Returns:
An enum indicating whether this reference represents the most recent version
of the resource.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.IsValidReference(Autodesk.Revit.DB.ExternalResourceType)
Checks whether the reference is in a valid format.
Remarks:
This function checks:
The server id corresponds to a valid server which
implements IExternalResourceServer.The server supports the given ExternalResourceType.The reference information is well-formed.
This function does not check whether the resource exists
on the server.
resourceType:
The type of resource which the ExternalResourceReference should
correspond to.
Returns:
True if this is a valid ExternalResourceReference. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.GetReferenceInformation
Returns a copy of an object containing previously-stored reference or lookup
information about the specific resource provided by the server.
Returns:
A copy of a (String, String) map containing previously-stored reference or
lookup information.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.CreateLocalResource(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.PathType)
Creates an ExternalResourceReference representing a local file managed
by Revit's built-in server.
doc:
The document containing the reference. If the PathType is relative,
the path will be made relative to the location of this Document. (If
this Document belongs to a workshared model,
the reference will be relative to the central model.)
resourceType:
The type of the external resource.
path:
A path to the external file. This path must be absolute. If the PathType is
relative, then Revit will relativize the path according to the location
of the given Document.
pathType:
An enum indicating the type of path which the ExternalResourceReference should use.
The PathType must be PathType.Server if the reference is to a Revit model on
Revit Server. The PathType must be PathType.Absolute if the reference is local
but the host model or host's central model are on Revit Server.
Returns:
The newly-created ExternalResourceReference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The PathType.Enum value is not valid for this resource type or Document location.
PathType.Content is not valid for Revit links. The PathType must be PathType.Server
if the resource is on Revit Server and is only valid for Revit links. The PathType
must be PathType.Absolute if the host document or the host document's central model
are on Revit Server.
-or-
The given path path is a cloud path which is not supported in this method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalResourceReference.InSessionPath
The path stores the full display path which includes the server name plus the path provided by ExternalResourceServer.
The path that Revit will present for user recognizing and browsing to this resource during one session of Revit.
This property allows ExternalResourceServers to handle cases where the path to a resource may vary between Revit sessions.
For example, if this ExternalResourceReference refers to a resource in a folder,
this property can be used to store the current path of the resource. If the resource is moved to another folder later,
the ExternalResourceServer could calculate the correct path for the resource from resource identification information
when it is loaded and store it in this property,
so that it will work correctly even if the rvt file is opened in a different location.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.Version
The version of the external data that was most recently loaded in Revit.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.ServerId
The id of the server that Revit is expecting to provide the external resource.
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.#ctor(Autodesk.Revit.DB.ExternalResourceReference)
Creates a new ExternalResourceReference from the given ExternalResourceReference.
other:
The ExternalResourceReference to copy.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference.#ctor(System.Guid,System.Collections.Generic.IDictionary{System.String,System.String},System.String,System.String)
Creates a new ExternalResourceReference from the given data.
serverId:
The id of the server associated with this
ExternalResourceReference. The server must implement
IExternalResourceServer.
referenceInformation:
The (String, String) map containing reference or lookup information that will
be stored in Revit.
version:
The version of the external data.
inSessionPath:
The path that identifies a resource in server. ExternalResourceServer must provide this path which should not contain the server name.
Revit internally will construct and store the full display path which includes the server name plus this path at the time a resource
is loaded into the model for use if the server is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceReference
This class identifies an external resource provided by an IExternalResourceServer.
Remarks:
The class contains:
The id of the IExternalResourceServer from which the resource was obtained.
A (String, String) map containing information that is meaningful to the server for accessing the desired data.
This could be something as simple as "4" to indicate that Revit wants option 4 from a range of several choices, or
something more detailed, such as a filename or directory path.
A String indicating the version of the resource that was most recently loaded in Revit.
A (String, String) map containing "in session" information that is meaningful to the server, but
which does not need to be saved permanently in the document on disk.
When calling an IExternalResourceServer, Revit will provide an ExternalResourceReference to
identify the specific resource that Revit is using from that server.  The server can then use the
relevant information in the (String, String) maps to retrieve the data from the correct source.
Since:
2015